young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_bootloader/libraries/drivers/src/at32f422_426_can.c
/**
  **************************************************************************
  * @file     at32f422_426_can.c
  * @brief    contains all the functions for the can firmware library
  **************************************************************************
  *
  * Copyright (c) 2025, Artery Technology, All rights reserved.
  *
  * The software Board Support Package (BSP) that is made available to 
  * download from Artery official website is the copyrighted work of Artery. 
  * Artery authorizes customers to use, copy, and distribute the BSP 
  * software and its related documentation for the purpose of design and 
  * development in conjunction with Artery microcontrollers. Use of the 
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f422_426_conf.h"

/** @addtogroup AT32F422_426_periph_driver
  * @{
  */

/** @defgroup CAN
  * @brief CAN driver modules
  * @{
  */

#ifdef CAN_MODULE_ENABLED

#ifdef SUPPORT_CAN_FD 
static const uint8_t dlc_to_bytes[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 12, 16, 20, 24, 32, 48, 64};
#endif

/** @defgroup CAN_private_functions
  * @{
  */

/**
  * @brief  deinitialize the can peripheral registers to their default reset values.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval none
  */
void can_reset(can_type* can_x)
{
  if(can_x == CAN1)
  {
    crm_periph_reset(CRM_CAN1_PERIPH_RESET, TRUE);
    crm_periph_reset(CRM_CAN1_PERIPH_RESET, FALSE);
  }
}

/**
  * @brief  enable can software reset, it is forces several components to a reset state.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of software reset request.
  *         this parameter can be: TRUE or FALSE.
  * @retval none.
  */
void can_software_reset(can_type* can_x, confirm_state new_state)
{
  can_x->ctrlstat_bit.reset = new_state;
}

#ifdef SUPPORT_CAN_FD
/**
  * @brief  enable the ISO 11898-1:2015 protocol mode of the can peripheral.
  *         can-fd frame format is according to ISO 11898-1:2015 or Bosch(non-ISO) standard.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of the can ISO 11898-1 protocol mode.
  *         this parameter can be: TRUE or FALSE.
  * @note   this bit is only writeable if RESET=1.
  * @retval none
  */
void can_fd_iso_mode_enable(can_type* can_x, confirm_state new_state)
{
  can_x->ctrlstat_bit.fd_iso = new_state;
}
#endif

/**
  * @brief  set the mode of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  mode_selection: select can mode type.
  *         this parameter can be one of the following values:
  *         - CAN_MODE_COMMUNICATE
  *         - CAN_MODE_EXT_LOOPBACK
  *         - CAN_MODE_EXT_LOOPBACK_ACK
  *         - CAN_MODE_INT_LOOPBACK
  *         - CAN_MODE_LISTENONLY
  *         - CAN_MODE_LISTENONLY_EXT
  *         - CAN_MODE_LISTENONLY_EXT_ACK
  * @retval none
  */
void can_mode_set(can_type* can_x, can_mode_type mode_selection)
{
  switch(mode_selection)
  {
    case CAN_MODE_COMMUNICATE:
      can_x->ctrlstat_bit.lbme = FALSE;
      can_x->ctrlstat_bit.sack = FALSE;
      can_x->ctrlstat_bit.lbmi = FALSE;
      can_x->ctrlstat_bit.lom = FALSE;
      break;
    case CAN_MODE_EXT_LOOPBACK:
      can_x->ctrlstat_bit.lbme = TRUE;
      can_x->ctrlstat_bit.sack = FALSE;
      can_x->ctrlstat_bit.lbmi = FALSE;
      can_x->ctrlstat_bit.lom = FALSE;
      break;
    case CAN_MODE_EXT_LOOPBACK_ACK:
      can_x->ctrlstat_bit.lbme = TRUE;
      can_x->ctrlstat_bit.sack = TRUE;
      can_x->ctrlstat_bit.lbmi = FALSE;
      can_x->ctrlstat_bit.lom = FALSE;
      break;
    case CAN_MODE_INT_LOOPBACK:
      can_x->ctrlstat_bit.lbme = FALSE;
      can_x->ctrlstat_bit.sack = FALSE;
      can_x->ctrlstat_bit.lbmi = TRUE;
      can_x->ctrlstat_bit.lom = FALSE;
      break;
    case CAN_MODE_LISTENONLY:
      can_x->ctrlstat_bit.lbme = FALSE;
      can_x->ctrlstat_bit.sack = FALSE;
      can_x->ctrlstat_bit.lbmi = FALSE;
      can_x->ctrlstat_bit.lom = TRUE;
      break;
    case CAN_MODE_LISTENONLY_EXT:
      can_x->ctrlstat_bit.lbme = TRUE;
      can_x->ctrlstat_bit.sack = FALSE;
      can_x->ctrlstat_bit.lbmi = FALSE;
      can_x->ctrlstat_bit.lom = TRUE;
      break;
    case CAN_MODE_LISTENONLY_EXT_ACK:
      can_x->ctrlstat_bit.lbme = TRUE;
      can_x->ctrlstat_bit.sack = TRUE;
      can_x->ctrlstat_bit.lbmi = FALSE;
      can_x->ctrlstat_bit.lom = TRUE;
      break;
    default:
      return;
  }
}

/**
  * @brief  enable the transceiver standby mode of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of the can transceiver standby mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval SUCCESS or ERROR
  */
error_status can_standby_mode_enable(can_type* can_x, confirm_state new_state)
{
  if (new_state != FALSE)
  {
    /* CAN-CTRL does not allow STBY to be set if a transmission is already active (TPE, TSONE or TSALL is set). */
    if(can_x->ctrlstat_bit.tsall || can_x->ctrlstat_bit.tsone || can_x->ctrlstat_bit.tpe)
      return ERROR;
    can_x->ctrlstat_bit.stby = TRUE;
  }
  else
  {
    can_x->ctrlstat_bit.stby = FALSE;
  }
  
  return SUCCESS;
}

/**
  * @brief  enable restricted operation of the can peripheral.
  *         a can node which is in restricted operation mode shall not transmit data frames 
  *         unless it is a potential time master for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of the can restricted operation.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void can_restricted_operation_enable(can_type* can_x, confirm_state new_state)
{
  can_x->tncfg_bit.rop = new_state;
}

/**
  * @brief  fill each can_bittime_struct member with its default value.
  * @param  can_bittime_struct: pointer to a can_bittime_type structure which will be initialized.
  * @retval none.
  */
void can_bittime_default_para_init(can_bittime_type* can_bittime_struct)
{
  /* reset can bittime structure parameters values */

