young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_bootloader/libraries/drivers/src/at32f422_426_can.c
  can_x->tbfmt = 0;
  can_x->tbfmt_bit.ide = can_txbuf_struct->id_type;
  can_x->tbfmt_bit.rmf = can_txbuf_struct->frame_type;  
  can_x->tbfmt_bit.dlc = can_txbuf_struct->data_length;
#ifdef  SUPPORT_CAN_FD  
  can_x->tbfmt_bit.brs = can_txbuf_struct->fd_rate_switch;
  can_x->tbfmt_bit.fdf = can_txbuf_struct->fd_format;
#endif
  
  /* write tx payload to the buffer ram. */
  for (byte_cnt = 0; byte_cnt < len; byte_cnt += 4U)
  {
    *wp++ = (((uint32_t)rp[byte_cnt + 3U] << 24U) |
             ((uint32_t)rp[byte_cnt + 2U] << 16U) |
             ((uint32_t)rp[byte_cnt + 1U] << 8U)  |
              (uint32_t)rp[byte_cnt]);
  }
  
  can_x->tbtyp = 0;
  can_x->tbtyp_bit.handle = can_txbuf_struct->handle;
  can_x->reserved8 = 0;
  
  if(txbuf_type == CAN_TXBUF_STB)
  {
    /* write TSNEXT, mark a slot filled and point to the next frame slot. */
    reg = (uint8_t*)&can_x->ctrlstat + 2;
    tmp = *reg;
    *reg = tmp | 0x40;    
  }
  
  return SUCCESS;
}

/**
  * @brief  read the receive buffer of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  can_rxbuf_struct: pointer to a structure which contains the buffer to be receive.
  * @retval SUCCESS or ERROR
  */
error_status can_rxbuf_read(can_type* can_x, can_rxbuf_type* can_rxbuf_struct)
{
#ifdef SUPPORT_CAN_FD
  uint8_t len = dlc_to_bytes[can_x->rbfmt_bit.dlc];
#else
  uint8_t len = can_x->rbfmt_bit.dlc;
#endif
  uint32_t* rp = (uint32_t*)can_x->rbdat;
  uint8_t* wp = can_rxbuf_struct->data;
  uint8_t byte_cnt;
  uint16_t pos;

  uint8_t* reg;
  uint8_t tmp; 

  if(can_x->ctrlstat_bit.rstat == CAN_RXBUF_STATUS_EMPTY)
  {
    /* receive buffer is empty. */
    return ERROR;  
  }
  
  can_rxbuf_struct->id_type = (can_identifier_type)can_x->rbfmt_bit.ide;
  switch(can_rxbuf_struct->id_type)
  {
    case CAN_ID_STANDARD:
      can_rxbuf_struct->id = 0x7FF & (can_x->rbid >> 18);
      break;
    case CAN_ID_EXTENDED:
      can_rxbuf_struct->id = (0x1FFFFFFF & can_x->rbid);
      break;
    default:
      return ERROR;
  }
  
  can_rxbuf_struct->frame_type = (can_frame_type)can_x->rbfmt_bit.rmf;
#ifdef SUPPORT_CAN_FD  
  can_rxbuf_struct->fd_format = (can_format_type)can_x->rbfmt_bit.fdf;
  can_rxbuf_struct->fd_rate_switch = (can_rate_switch_type)can_x->rbfmt_bit.brs;
  can_rxbuf_struct->fd_error_state = (can_error_state_type)can_x->rbfmt_bit.esi;
#endif 
  can_rxbuf_struct->kind_error = (can_error_type)can_x->rbfmt_bit.koer;
  can_rxbuf_struct->recv_frame = (can_recv_frame_type)can_x->rbfmt_bit.lbf;
  can_rxbuf_struct->data_length = (can_data_length_type)can_x->rbfmt_bit.dlc;
  
  /* read the buffer ram to rx payload */
  for (byte_cnt = 0; byte_cnt < len; byte_cnt += 4U)
  {
    wp[byte_cnt] = *rp & 0xFF;
    wp[byte_cnt+1U] = (*rp >> 8U) & 0xFF;
    wp[byte_cnt+2U] = (*rp >> 16U) & 0xFF;
    wp[byte_cnt+3U] = (*rp >> 24U) & 0xFF;
    rp++;
  }
  
  can_x->llcformat = can_x->rbfmt;
  pos = (can_x->llcsize_bit.llcaot / 4) - 4;
  can_rxbuf_struct->rx_timestamp = (uint32_t)can_x->rbdat[pos];
  can_rxbuf_struct->cycle_time = (uint16_t)can_x->rbdat[pos + 2];
  
  /* set RREL, receive buffer release. */
  reg = (uint8_t*)&can_x->ctrlstat + 3;
  tmp = *reg;
  *reg = tmp | 0x10;

  return SUCCESS;
}

/**
  * @brief  enable acceptance filters of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  filter_number: point to a specific acceptance filter.
  *         this parameter can be one of the following values:  
  *         - CAN_FILTER_NUM_0
  *         - CAN_FILTER_NUM_1
  *         - CAN_FILTER_NUM_2
  *         - CAN_FILTER_NUM_3
  *         - CAN_FILTER_NUM_4
  *         - CAN_FILTER_NUM_5
  *         - CAN_FILTER_NUM_6
  *         - CAN_FILTER_NUM_7
  *         - CAN_FILTER_NUM_8
  *         - CAN_FILTER_NUM_9
  *         - CAN_FILTER_NUM_10
  *         - CAN_FILTER_NUM_11
  *         - CAN_FILTER_NUM_12
  *         - CAN_FILTER_NUM_13
  *         - CAN_FILTER_NUM_14
  *         - CAN_FILTER_NUM_15
  * @param  new_state: new state of the specific acceptance filter.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void can_filter_enable(can_type* can_x, can_filter_type filter_number, confirm_state new_state)
{
  if (new_state != FALSE)
  {
    can_x->acfctrl_bit.ae_x |= (uint16_t)(1<<filter_number);
  }
  else
  {
    can_x->acfctrl_bit.ae_x &= (uint16_t)~(1<<filter_number);
  }
}

/**
  * @brief  fill each filter_config_struct member with its default value.
  * @param  filter_config_struct: pointer to a can_filter_config_type structure which will be initialized.
  * @retval none.
  */
void can_filter_default_para_init(can_filter_config_type* filter_config_struct)
{
  /* reset can filter config structure parameters values */
 
  filter_config_struct->code_para.id = 0;
  filter_config_struct->code_para.id_type = CAN_ID_STANDARD;
  filter_config_struct->code_para.frame_type = CAN_FRAME_DATA;
  filter_config_struct->code_para.data_length = 0;
  filter_config_struct->code_para.recv_frame = CAN_RECV_NORMAL;
#ifdef SUPPORT_CAN_FD
  filter_config_struct->code_para.fd_format = CAN_FORMAT_CLASSIC;
  filter_config_struct->code_para.fd_rate_switch = CAN_BRS_OFF;
  filter_config_struct->code_para.fd_error_state = CAN_ESI_ACTIVE;
#endif 
 
  filter_config_struct->mask_para.id = 0xFFFFFFFF;
  filter_config_struct->mask_para.id_type = TRUE;
  filter_config_struct->mask_para.frame_type = TRUE;
  filter_config_struct->mask_para.data_length = 0xF;
  filter_config_struct->mask_para.recv_frame = TRUE;
#ifdef SUPPORT_CAN_FD
  filter_config_struct->mask_para.fd_format = TRUE;
  filter_config_struct->mask_para.fd_rate_switch = TRUE;
  filter_config_struct->mask_para.fd_error_state = TRUE;
#endif 
}

/**
  * @brief  set acceptance filters of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  filter_number: point to a specific acceptance filter number.
  *         this parameter can be one of the following values:  
  *         - CAN_FILTER_NUM_0
  *         - CAN_FILTER_NUM_1
  *         - CAN_FILTER_NUM_2
  *         - CAN_FILTER_NUM_3
  *         - CAN_FILTER_NUM_4
  *         - CAN_FILTER_NUM_5
  *         - CAN_FILTER_NUM_6
  *         - CAN_FILTER_NUM_7
  *         - CAN_FILTER_NUM_8
  *         - CAN_FILTER_NUM_9
  *         - CAN_FILTER_NUM_10
  *         - CAN_FILTER_NUM_11
  *         - CAN_FILTER_NUM_12
  *         - CAN_FILTER_NUM_13
  *         - CAN_FILTER_NUM_14
  *         - CAN_FILTER_NUM_15
  * @param  filter_config_struct: pointer to a structure which contains acceptance filter config.
  * @retval none
  */
void can_filter_set(can_type* can_x, can_filter_type filter_number, can_filter_config_type* filter_config_struct)
{
  can_x->acfctrl_bit.acfadr = filter_number;
  
