young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_bootloader/libraries/drivers/src/at32f422_426_can.c
  switch(filter_config_struct->code_para.id_type)
  {
    case CAN_ID_STANDARD:
      can_x->fcid = (0x7FF & filter_config_struct->code_para.id)<<18;
      break;
    case CAN_ID_EXTENDED:
      can_x->fcid = (0x1FFFFFFF & filter_config_struct->code_para.id);
      break;
    default:
      break;
  }
  can_x->fcfmt_bit.ide = filter_config_struct->code_para.id_type;
  can_x->fcfmt_bit.rmf = filter_config_struct->code_para.frame_type;
  can_x->fcfmt_bit.dlc = filter_config_struct->code_para.data_length;
  can_x->fcfmt_bit.lbf = filter_config_struct->code_para.recv_frame;
#ifdef SUPPORT_CAN_FD  
  can_x->fcfmt_bit.brs = filter_config_struct->code_para.fd_rate_switch;
  can_x->fcfmt_bit.fdf = filter_config_struct->code_para.fd_format;
  can_x->fcfmt_bit.esi = filter_config_struct->code_para.fd_error_state;
#endif  
  
  can_x->fmid = 0xFFFFFFFF;
  /* write mask_id by id_type of filter_code_struct. */
  switch(filter_config_struct->code_para.id_type)
  {
    case CAN_ID_STANDARD:
      can_x->fmid &= ~((0x7FF & ~filter_config_struct->mask_para.id)<<18);
      break;
    case CAN_ID_EXTENDED:
      can_x->fmid &= ~(0x1FFFFFFF & ~filter_config_struct->mask_para.id);
      break;
    default:
      break;
  }
  can_x->fmfmt = 0xFFFFFFFF;
  can_x->fmfmt_bit.ide = filter_config_struct->mask_para.id_type;
  can_x->fmfmt_bit.rmf = filter_config_struct->mask_para.frame_type;  
  can_x->fmfmt_bit.dlc = filter_config_struct->mask_para.data_length;
  can_x->fmfmt_bit.lbf = filter_config_struct->mask_para.recv_frame; 
#ifdef SUPPORT_CAN_FD  
  can_x->fmfmt_bit.brs = filter_config_struct->mask_para.fd_rate_switch;
  can_x->fmfmt_bit.fdf = filter_config_struct->mask_para.fd_format;
  can_x->fmfmt_bit.esi = filter_config_struct->mask_para.fd_error_state;
#endif  
  can_x->fmtyp = 0xFFFFFFFF;
  can_x->reserved6[0] = 0xFFFFFFFF;
}

/**
  * @brief  release the receive buffer of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval SUCCESS or ERROR
  */
error_status can_rxbuf_release(can_type* can_x)
{
  uint8_t* reg;
  uint8_t tmp; 

  if(can_x->ctrlstat_bit.rstat == CAN_RXBUF_STATUS_EMPTY)
  {
    /* receive buffer is empty. */
    return ERROR;
  }

  /* set RREL, receive buffer release. */
  reg = (uint8_t*)&can_x->ctrlstat + 3;
  tmp = *reg;
  *reg = tmp | 0x10;

  return SUCCESS;
}

/**
  * @brief  return the bit position in the frame where the arbitration has been lost.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval the value of the bit position in the frame.
  */
uint8_t can_arbitration_lost_position_get(can_type* can_x)
{
  return (uint8_t)can_x->err_bit.alc;
}

/**
  * @brief  set the value of receive buffer almost full warning limit.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  warning_value: defines the internal warning limit of receive buffer almost full. 
  *         this parameter can be 1~6.
  * @retval none
  */
void can_rxbuf_warning_set(can_type* can_x, uint8_t warning_value)
{
  can_x->err_bit.afwl = warning_value;
}

/**
  * @brief  set the value of error warning limit controls EIF.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  warning_value: programmable error warning limit = (warning_value + 1)*8. possible limit values: 8, 16, §Ò§ß 128. 
  *         this parameter can be 0~15.
  * @retval none
  */
void can_error_warning_set(can_type* can_x, uint8_t warning_value)
{
  can_x->err_bit.ewl = warning_value;
}

/**
  * @brief  return the receive error counter of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval the value of receive error counter.
  */
uint8_t can_receive_error_counter_get(can_type* can_x)
{
  return (uint8_t)can_x->err_bit.recnt;
}

/**
  * @brief  return the transmit error counter of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval the value of transmit error counter.
  */
uint8_t can_transmit_error_counter_get(can_type* can_x)
{
  return (uint8_t)can_x->err_bit.tecnt;
}

/**
  * @brief  return error type of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval can kind of error type. 
  *         the returned value can be one of the following values:
  *         - CAN_KOER_NOERR
  *         - CAN_KOER_BIT
  *         - CAN_KOER_FORM
  *         - CAN_KOER_STUFF
  *         - CAN_KOER_ACK
  *         - CAN_KOER_CRC
  *         - CAN_KOER_OTHER
  *         - CAN_KOER_PCRC
  */
can_error_type can_kind_error_get(can_type* can_x)
{
  return (can_error_type)can_x->err_bit.koer;
}

/**
  * @brief  get bus off flag of the specified can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval status of can bus off flag, the returned value can be: SET or RESET.
  */
flag_status can_busoff_get(can_type* can_x)
{
  flag_status bit_status = RESET;
  if(can_x->ctrlstat_bit.busoff)
  {
    bit_status = SET;
  }
  return bit_status; 
}

/**
  * @brief  resets the error counters and therefore forces the node to leave the bus off state.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval none.
  */
void can_busoff_reset(can_type* can_x)
{
  can_x->ctrlstat_bit.busoff = SET;
}

/**
  * @brief  set the secondary transmit buffer operation mode.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  stb_transmit_mode: secondary transmit buffer operation mode.
  *         this parameter can be one of the following values:
  *         - CAN_STB_TRANSMIT_BY_FIFO
  *         - CAN_STB_TRANSMIT_BY_ID
  * @note   the secondary transmit buffer operation mode shall be switched only if RESET=1.
  * @retval none
  */
void can_stb_transmit_mode_set(can_type* can_x, can_stb_transmit_mode_type stb_transmit_mode)
{
  can_x->ctrlstat_bit.tsmode = stb_transmit_mode;
}

/**
  * @brief  get the status of can secondary transmit buffer.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval the status of the secondary transmit buffer. 
  *         the returned value can be one of the following values:
  *         - CAN_STB_STATUS_EMPTY
  *         - CAN_STB_STATUS_LESS
  *         - CAN_STB_STATUS_MORE
  *         - CAN_STB_STATUS_FULL
  */
can_stb_status_type can_stb_status_get(can_type* can_x)
{
  return (can_stb_status_type)can_x->ctrlstat_bit.tsstat;
}

/**
  * @brief  get the status of can frame transmissions.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  transmit_status_struct: pointer to a structure which contains the status of the frame transmissions.
  * @retval none
  */
void can_transmit_status_get(can_type* can_x, can_transmit_status_type* transmit_status_struct)
{
  transmit_status_struct->current_handle = can_x->tstat_bit.handle_1;
  transmit_status_struct->current_tstat = (can_tstat_encoding_type)can_x->tstat_bit.tstat_1;
  transmit_status_struct->final_handle = can_x->tstat_bit.handle_2;
  transmit_status_struct->final_tstat = (can_tstat_encoding_type)can_x->tstat_bit.tstat_2;
}

/**
  * @brief  get the status of can receive buffer.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @retval the status of can receive buffer. 
  *         the returned value can be:
  *         - CAN_RXBUF_STATUS_EMPTY
  *         - CAN_RXBUF_STATUS_LESS
  *         - CAN_RXBUF_STATUS_ALMOST
  *         - CAN_RXBUF_STATUS_FULL
  *         - CAN_RXBUF_STATUS_OVERFLOW
  */
can_rxbuf_status_type can_rxbuf_status_get(can_type* can_x)
{
  uint8_t status = can_x->ctrlstat_bit.rstat;
  
  if(can_x->ctrlstat_bit.rov == SET)
  {
    status = CAN_RXBUF_STATUS_OVERFLOW;
  }
  
  return (can_rxbuf_status_type)status;
}

/**
  * @brief  set the mode of receive buffer overflow.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  rxbuf_overflow_mode: the mode of receive buffer overflow.
  *         this parameter can be one of the following values:
  *         - CAN_RXBUF_OVERFLOW_BE_OVWR
  *         - CAN_RXBUF_OVERFLOW_BE_LOSE
  * @retval none
  */
void can_rxbuf_overflow_mode_set(can_type* can_x, can_rxbuf_overflow_mode_type rxbuf_overflow_mode)
{
  can_x->ctrlstat_bit.rom = rxbuf_overflow_mode;
}

/**
  * @brief  enable receive buffer stores all frames include frames with error.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of receive buffer stores frames.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void can_receive_all_enable(can_type* can_x, confirm_state new_state)
{
  can_x->ctrlstat_bit.rball = new_state;
}

/**
  * @brief  abort a transmission from the primary transmit buffer or the secondary transmit buffer of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  abort_type: abort transmit type.
  *         this parameter can be one of the following values:
  *         - CAN_ABORT_TRANSMIT_PTB
  *         - CAN_ABORT_TRANSMIT_STB
  * @retval none
  */
void can_transmit_abort(can_type* can_x, can_abort_transmit_type abort_type)
{
  uint8_t* reg = (uint8_t*)&can_x->ctrlstat + 1;
  uint8_t tmp;
  
  /* avoid duplicate setting these bits(TSA, TSALL, TSONE, TPA, TPE). */
  tmp = *reg & 0xE0;
  *reg = tmp | abort_type;
}

/**
  * @brief  clear the secondary transmit buffer of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  abort_type: abort transmit type.
  *         this parameter can be one of the following values:
  *         - CAN_CLEAR_STB_ONE
  *         - CAN_CLEAR_STB_ALL
  * @retval SUCCESS or ERROR
  */
error_status can_stb_clear(can_type* can_x, can_clear_stb_type clear_type)
{
  uint8_t* reg = (uint8_t*)&can_x->ctrlstat + 1;
  uint8_t tmp;
  
  if(can_x->ctrlstat_bit.tsstat == CAN_STB_STATUS_EMPTY)
  {
    /* the secondary transmit buffer is empty. */
    return ERROR; 
  }
  
  /* avoid duplicate setting these bits(TSA, TSALL, TSONE, TPA, TPE). */
  tmp = *reg & 0xE0;
  *reg = tmp | clear_type;
  
  return SUCCESS;
}

/**
  * @brief  transmit the frame from txbuf of the can peripheral.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  transmit_type: select transmit txbuf type.
  *         this parameter can be one of the following values:
  *         - CAN_TRANSMIT_PTB
  *         - CAN_TRANSMIT_STB_ONE
  *         - CAN_TRANSMIT_STB_ALL
  * @retval SUCCESS or ERROR
  */
error_status can_txbuf_transmit(can_type* can_x, can_txbuf_transmit_type transmit_type)
{
  uint8_t* reg = (uint8_t*)&can_x->ctrlstat + 1;
  uint8_t tmp; 
  
  /* once standby is activated no transmission is possible. */
  if(can_x->ctrlstat_bit.stby == SET)
    return ERROR;

  switch(transmit_type)
  {
    case CAN_TRANSMIT_PTB:
      if(can_x->ctrlstat_bit.tpe || can_x->ctrlstat_bit.tpa)
        return ERROR;     
      break;
    case CAN_TRANSMIT_STB_ONE:
    case CAN_TRANSMIT_STB_ALL:
      if(can_x->ctrlstat_bit.tsstat == CAN_STB_STATUS_EMPTY)
        return ERROR;     
      if(can_x->ctrlstat_bit.tsall || can_x->ctrlstat_bit.tsone || can_x->ctrlstat_bit.tsa)
        return ERROR;
      break;
    default:
      return ERROR;
  }
  
  /* avoid duplicate setting these bits(TSA, TSALL, TSONE, TPA, TPE). */
  tmp = *reg & 0xE0;
  *reg = tmp | transmit_type;
  
  return SUCCESS;
}

/**
  * @brief  set the reference message identifier for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  id_type: the identifier type of reference message for ttcan.
  *         this parameter can be one of the following values:
  *         - CAN_ID_STANDARD
  *         - CAN_ID_EXTENDED
  * @param  id: the identifier of reference message for ttcan.
  * @retval none
  */
void can_ttcan_ref_message_set(can_type* can_x, can_identifier_type id_type, uint32_t id)
{
  can_x->refmsg_bit.ref_ide = id_type;
  switch(id_type)
  {
    case CAN_ID_STANDARD:
      can_x->refmsg_bit.ref_id = (0x7FF & id);
      break;
    case CAN_ID_EXTENDED:
      can_x->refmsg_bit.ref_id = (0x1FFFFFFF & id);
      break;
    default:
      break;
  }
}

/**
  * @brief  set the timer prescaler for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  div_value: can ttcan time trigger div type.
  *         this parameter can be one of the following values:
  *         - CAN_TTCAN_TIMER_DIV_1
  *         - CAN_TTCAN_TIMER_DIV_2
  *         - CAN_TTCAN_TIMER_DIV_4
  *         - CAN_TTCAN_TIMER_DIV_8
  * @retval none
  */
void can_ttcan_timer_div_set(can_type* can_x, can_ttcan_timer_div_type div_value)
{
  can_x->ttcfg_bit.t_presc = div_value;
}

/**
  * @brief  enable time trigger for ttcan.
  *         if ttcan enabled, the timer for ttcan is running.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of ttcan enable.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void can_ttcan_enable(can_type* can_x, confirm_state new_state)
{
  can_x->ttcfg_bit.tten = new_state;
}

/**
  * @brief  enable transmit buffer support for ttcan mode.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  new_state: new state of transmit buffer support for ttcan.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void can_ttcan_txbuf_enable(can_type* can_x, confirm_state new_state)
{
  can_x->ctrlstat_bit.tttbm = new_state;
}

/**
  * @brief  set the trigger type for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  trigger_type: can ttcan trigger type.
  *         this parameter can be one of the following values:
  *         - CAN_TTCAN_TRIGGER_IMMEDIATE
  *         - CAN_TTCAN_TRIGGER_TIME
  *         - CAN_TTCAN_TRIGGER_SINGLE_TRANSMIT
  *         - CAN_TTCAN_TRIGGER_TRANSMIT_START
  *         - CAN_TTCAN_TRIGGER_TRANSMIT_STOP
  * @retval none
  */
void can_ttcan_trigger_type_set(can_type* can_x, can_ttcan_trigger_type trigger_type)
{
  can_x->ttcfg_bit.ttype = trigger_type;
}

/**
  * @brief  set the cycle time for a time trigger for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  trigger_time: defines the cycle time for a time trigger.
  * @retval none
  */
void can_ttcan_trigger_set(can_type* can_x, uint16_t trigger_time)
{
  uint16_t* reg = (uint16_t*)&(can_x->tttrig);
  *reg = trigger_time;
}

/**
  * @brief  set the cycle time for a watch time trigger for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  watch_trigger_time: defines the cycle time for a watch time trigger.
  * @retval none
  */
void can_ttcan_watch_trigger_set(can_type* can_x, uint16_t watch_trigger_time)
{
  uint16_t* reg = (uint16_t*)&(can_x->tttrig);
  *(reg + 1) = watch_trigger_time;
}

/**
  * @brief  set the txbuf slot status for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  txbuf_number: pointer to a txbuf frame slot.
  *         this parameter can be one of the following values:  
  *         - CAN_TTCAN_TXBUF_NUM_0
  *         - CAN_TTCAN_TXBUF_NUM_1
  *         - CAN_TTCAN_TXBUF_NUM_2
  *         - CAN_TTCAN_TXBUF_NUM_3
  * @param  ttcan_buffer_type: ttcan txbuf slot status.
  *         this parameter can be one of the following values:
  *         - CAN_TTCAN_TXBUF_EMPTY
  *         - CAN_TTCAN_TXBUF_FILLED   
  * @retval none
  */
void can_ttcan_txbuf_status_set(can_type* can_x,  can_ttcan_txbuf_type txbuf_number, can_ttcan_txbuf_status_type status_type)
{
  can_x->ttcfg_bit.tbptr = txbuf_number;
  switch(status_type)
  {
    case CAN_TTCAN_TXBUF_EMPTY:
      can_x->ttcfg_bit.tbe = TRUE;
      break;
    case CAN_TTCAN_TXBUF_FILLED:
      can_x->ttcfg_bit.tbf = TRUE;
      break;
    default:
      return;
  }
}

/**
  * @brief  get the txbuf slot status for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  txbuf_number: pointer to a txbuf frame slot.
  *         this parameter can be one of the following values:  
  *         - CAN_TTCAN_TXBUF_NUM_0
  *         - CAN_TTCAN_TXBUF_NUM_1
  *         - CAN_TTCAN_TXBUF_NUM_2
  *         - CAN_TTCAN_TXBUF_NUM_3
  * @retval ttcan_buffer_type: ttcan txbuf slot status.
  *         this parameter can be one of the following values:
  *         - CAN_TTCAN_TXBUF_EMPTY
  *         - CAN_TTCAN_TXBUF_FILLED
  */
can_ttcan_txbuf_status_type can_ttcan_txbuf_status_get(can_type* can_x, can_ttcan_txbuf_type txbuf_number)
{
  can_x->ttcfg_bit.tbptr = txbuf_number;
  if(can_x->ctrlstat_bit.tsff != SET)
  {
    return CAN_TTCAN_TXBUF_EMPTY;
  }
  else{
    return CAN_TTCAN_TXBUF_FILLED;
  }
}

/**
  * @brief  write the transmission buffer of the can peripheral for ttcan.
  * @param  can_x: select the can peripheral.
  *         this parameter can be one of the following values:
  *         CAN1.
  * @param  txbuf_number: pointer to a txbuf frame slot.
  *         this parameter can be one of the following values:  
  *         - CAN_TTCAN_TXBUF_NUM_0
  *         - CAN_TTCAN_TXBUF_NUM_1
  *         - CAN_TTCAN_TXBUF_NUM_2
  *         - CAN_TTCAN_TXBUF_NUM_3
  * @param  can_txbuf_struct: pointer to a structure which contains the buffer to be trans.
  * @retval SUCCESS or ERROR.
  */
error_status can_ttcan_txbuf_write(can_type* can_x,  can_ttcan_txbuf_type txbuf_number, can_txbuf_type* can_txbuf_struct)
{
#ifdef SUPPORT_CAN_FD 
  uint8_t len = dlc_to_bytes[can_txbuf_struct->data_length];
#else 
  uint8_t len = can_txbuf_struct->data_length;
#endif 
  uint32_t *wp = (uint32_t*)can_x->tbdat;
  uint8_t *rp = can_txbuf_struct->data;
  uint8_t byte_cnt;
  
  can_x->ttcfg_bit.tbptr = txbuf_number;
  if(can_x->ctrlstat_bit.tsff == SET)
  {
    /* the buffer slot selected by tbptr be filled are write-locked. */
    return ERROR;
  }
  
  switch(can_txbuf_struct->id_type)
  {
    case CAN_ID_STANDARD:
      can_x->tbid = (0x7FF & can_txbuf_struct->id)<<18;
      break;
    case CAN_ID_EXTENDED:
      can_x->tbid = (0x1FFFFFFF & can_txbuf_struct->id);
      break;
    default:
      return ERROR;
  }
  can_x->tbid |= (can_txbuf_struct->tx_timestamp << 31);
  
